//Задача о пути. Рассмотрите сетку размером m на n. Ваша задача — подсчитать количество 
//различных путей от верхнего левого до нижнего правого угла, перемещаясь только вправо 
//и вниз.

uses Fact;

var m, n: integer;

begin
  writeln('Введите количество строк: ');
  readln(m);
  writeln('Введите колчисетво колонок: ');
  readln(n);

  writeln('Кол-во вариантов: ', factor(m + n - 2) div (factor(m - 1) * factor(n - 1)));
end.
